src/Openfoam/AeroSUV/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2206                                  |
|   \  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



scale 1.0;

vertices (
    (-23.933048 -6.14298 -0.0239946)
    (50.00311 -6.14298 -0.0239946)
    (50.00311 6.14298 -0.0239946)
    (-23.933048 6.14298 -0.0239946)
    (-23.933048 -6.14298 5.6015015)
    (50.00311 -6.14298 5.6015015)
    (50.00311 6.14298 5.6015015)
    (-23.933048 6.14298 5.6015015)
);

blocks (
    hex (0 1 2 3 4 5 6 7) (296 50 23) simpleGrading (1 1 1)
);

edges ();

boundary (
    inlet  { type patch; faces ((0 4 7 3)); }
    outlet { type patch; faces ((1 2 6 5)); }
    bottom { type wall; faces ((0 1 2 3)); }
    top    { type symmetryPlane; faces ((4 7 6 5)); }
    front  { type symmetryPlane; faces ((0 4 5 1)); }
    back   { type symmetryPlane; faces ((3 2 6 7)); }
);

mergePatchPairs ();
