src/Openfoam/AeroSUV/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

// Default discretisation schemes
ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
    grad(U)         cellLimited Gauss linear 1;
}

divSchemes
{
    div(phi,U)                      Gauss linearUpwind grad(U);
    div(phi,k)                      Gauss limitedLinear 1;
    div(phi,epsilon)               Gauss limitedLinear 1;
    div(phi,omega)                 Gauss limitedLinear 1;
    div((nuEff*dev2(T(grad(U)))))  Gauss linear;
    div(div(phi,U))                Gauss linear;
}



laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         False;
    p               None;
}
